NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21A010F512IM32.svd
        <register>
          <name>IF</name>
          <description>Interrupt Flag</description>
          <addressOffset>0x024</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800F338F</resetMask>
          <fields>
            <field>
              <name>SINGLEFIFODVL</name>
              <description>Single FIFO Data Valid Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANFIFODVL</name>
              <description>Scan FIFO Data Valid Level</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLECMP</name>
              <description>Single Result Window Compare</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANCMP</name>
              <description>Scan Result Window Compare</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANENTRYDONE</name>
              <description>Scan Entry Done</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANTABLEDONE</name>
              <description>Scan Table Done</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLEDONE</name>
              <description>Single Conversion Done</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLARITYERR</name>
              <description>Polarity Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTALLOCERR</name>
              <description>Port Allocation Error</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLEFIFOOF</name>
              <description>Single FIFO Overflow</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANFIFOOF</name>
              <description>Scan FIFO Overflow</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLEFIFOUF</name>
              <description>Single FIFO Underflow</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANFIFOUF</name>
              <description>Scan FIFO Underflow</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM23ABORTERROR</name>
              <description>EM2/3 Abort Error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IEN</name>
          <description>Interrupt Enable</description>
          <addressOffset>0x028</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800F338F</resetMask>
          <fields>
            <field>
              <name>SINGLEFIFODVL</name>
              <description>Single FIFO Data Valid Level Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANFIFODVL</name>
              <description>Scan FIFO Data Valid Level Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLECMP</name>
              <description>Single Result Window Compare Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANCMP</name>
              <description>Scan Result Window Compare Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANENTRYDONE</name>
              <description>Scan Entry Done Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANTABLEDONE</name>
              <description>Scan Table Done Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLEDONE</name>
              <description>Single Conversion Done Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>POLARITYERR</name>
              <description>Polarity Error Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTALLOCERR</name>
              <description>Port Allocation Error Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLEFIFOOF</name>
              <description>Single FIFO Overflow Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANFIFOOF</name>
              <description>Scan FIFO Overflow Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SINGLEFIFOUF</name>
              <description>Single FIFO Underflow Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCANFIFOUF</name>
              <description>Scan FIFO Underflow Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EM23ABORTERROR</name>
              <description>EM2/3 Abort Error Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIGGER</name>
          <description>Trigger</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00011717</resetMask>
          <fields>
            <field>
              <name>SCANTRIGSEL</name>
              <description>Scan Trigger Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate triggering. The scan queue will be disabled once all conversions in the scan table are complete, unless TRIGGERACTION is set to continuous.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER</name>
                  <description>Triggers when the local timer count reaches zero. </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCLKGRP</name>
                  <description>Triggers on PRS0 from a timer module that is using the same clock group as the ADC and has been programmed to use the same clock source as the ADC.  The prescale may be different between the ADC and the timer module.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSPOS</name>
                  <description>Triggers on asynchronous PRS0 positive edge.  Requires PRS0 to go low for 3 ADC_CLKs before another positive edge can be detected.  Generates an additional delay of 1 to 2 ADC_SRC_CLK cycles for synchronization.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSNEG</name>
                  <description>Triggers on asynchronous PRS0 negative edge.  Requires PRS0 to go high for 3 ADC_CLKs before another negative edge can be detected.  Generates an additional delay of 1 to 2 ADC_SRC_CLK cycles for synchronization.  PRSNEG should only be used when the trigger source is from a module that remains powered during EM23.  For modules (ie: TIMER) that power down during EM23, PRSPOS should be used for an asynchronous trigger, and PRSCLKGRP should be used for a synchronous trigger.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCANTRIGACTION</name>
              <description>Scan Trigger Action</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>For TRIGSEL=IMMEDIATE, goes through the scan table once and disables queue.  For TRIGSEL = TIMER, PRSCLKGRP, PRSPOS, PRSNEG, goes through the scan table once per trigger.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Goes through the scan table, converts each entry with a mask bit set, and puts it back into the scan queue to repeat again continuously.  The queues are first come first serve.  If both queues are triggered, the single queue will get to convert after each scan table completes.  The scan queue will get to convert after each single conversion completes.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLETRIGSEL</name>
              <description>Single Trigger Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMMEDIATE</name>
                  <description>Immediate triggering. The single queue will be disabled once the conversion is complete, unless TRIGGERACTION is set to continuous.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMER</name>
                  <description>Triggers when the timer count reaches zero. </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSCLKGRP</name>
                  <description>Triggers on PRS1 from a timer module that is using the same clock group as the ADC and has been programmed to use the same clock source as the ADC.  The prescale may be different between the ADC and the timer module.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSPOS</name>
                  <description>Triggers on asynchronous PRS1 positive edge.  Requires PRS1 to go low for 3 ADC_CLKs before another positive edge can be detected.  Generates an additional delay of 1 to 2 ADC_SRC_CLK cycles for synchronization.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PRSNEG</name>
                  <description>Triggers on asynchronous PRS1 negative edge.  Requires PRS1 to go high for 3 ADC_CLKs before another negative edge can be detected.  Generates an additional delay of 1 to 2 ADC_SRC_CLK cycles for synchronization.  PRSNEG should only be used when the trigger source is from a module that remains powered during EM23.  For modules (ie: TIMER) that power down during EM23, PRSPOS should be used for an asynchronous trigger, and PRSCLKGRP should be used for a synchronous trigger.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLETRIGACTION</name>
              <description>Single Trigger Action</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONCE</name>
                  <description>For TRIGSEL=IMMEDIATE, converts the single queue once and disables queue.  For TRIGSEL = TIMER, PRSCLKGRP, PRSPOS, PRSNEG, converts the single queue once per trigger.ask.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Converts the single queue, then checks for a pending scan queue before converting the single queue again continuously.  The queues are first come first serve.  If both queues are continuous, the IADC alternates between them.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLETAILGATE</name>
              <description>Single Tailgate Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TAILGATEOFF</name>
                  <description>The single queue is ready to start warming up and converting once the trigger had been detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAILGATEON</name>
                  <description>After the single queue's trigger is detected, it must wait until the end of a scan operation before the Single queue can be converted.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG0</name>
          <description>Configration</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002060</resetValue>
          <resetMask>0x30E770FF</resetMask>
          <fields>
            <field>
              <name>ADCMODE</name>
              <description>ADC Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>High speed mode with a maximum CLK_ADC of 10 MHz.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSRHS</name>
              <description>High Speed OSR</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HISPD2</name>
                  <description>High speed over sampling of 2x.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD4</name>
                  <description>High speed over sampling of 4x. </description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD8</name>
                  <description>High speed over sampling of 8x.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD16</name>
                  <description>High speed over sampling of 16x.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD32</name>
                  <description>HIgh speed over sampling of 32x.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISPD64</name>
                  <description>High speed over sampling of 64x.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANALOGGAIN</name>
              <description>Analog Gain</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANAGAIN0P5</name>
                  <description>Analog gain of 0.5x.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANAGAIN1</name>
                  <description>Analog gain of 1x.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANAGAIN2</name>
                  <description>Analog gain of 2x.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANAGAIN3</name>
                  <description>Analog gain of 3x.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANAGAIN4</name>
                  <description>Analog gain of 4x.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFSEL</name>
              <description>Reference Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBGR</name>
                  <description>Internal 1.21 V reference.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREF</name>
                  <description>External Reference. (Calibrated for 1.25V nominal.)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDX</name>
                  <description>AVDD (unbuffered)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDX0P8BUF</name>
                  <description>AVDD (buffered) * 0.8</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TWOSCOMPL</name>
              <description>Two's Complement</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automatic: Single ended measurements are reported as unipolar and differential measurements are reported as bipolar.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCEUNIPOLAR</name>
                  <description>Force all measurements to result in unipolar output. Negative differential numbers will saturate to 0.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCEBIPOLAR</name>
                  <description>Force all measurements to result in bipolar output.  Single ended measurements are half the range, but allow for small negative measurements.</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
