NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21A010F512IM32.svd
        <register>
          <name>STATUS2</name>
          <description>No Description</description>
          <addressOffset>0x09C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <fields>
            <field>
              <name>PREVSTATE1</name>
              <description>Previous Radio State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Radio is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWARM</name>
                  <description>Radio is enabling receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>Radio is listening for incoming frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Radio is receiving a frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPD</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2RX</name>
                  <description>Radio remains in receive mode after frame reception is completed</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVERFLOW</name>
                  <description>Received data was lost due to full receive buffer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2TX</name>
                  <description>Radio is disabling receiver and enabling transmitter</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWARM</name>
                  <description>Radio is enabling transmitter</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Radio is transmitting data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPD</name>
                  <description>Radio is powering down transmitter and going to OFF state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX</name>
                  <description>Radio is disabling transmitter and enabling reception</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2TX</name>
                  <description>Radio is preparing for a transmission after the previous transmission was ended</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREVSTATE2</name>
              <description>Previous Radio State 2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Radio is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWARM</name>
                  <description>Radio is enabling receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>Radio is listening for incoming frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Radio is receiving a frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPD</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2RX</name>
                  <description>Radio remains in receive mode after frame reception is completed</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVERFLOW</name>
                  <description>Received data was lost due to full receive buffer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2TX</name>
                  <description>Radio is disabling receiver and enabling transmitter</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWARM</name>
                  <description>Radio is enabling transmitter</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Radio is transmitting data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPD</name>
                  <description>Radio is powering down transmitter and going to OFF state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX</name>
                  <description>Radio is disabling transmitter and enabling reception</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2TX</name>
                  <description>Radio is preparing for a transmission after the previous transmission was ended</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREVSTATE3</name>
              <description>Previous Radio State 3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Radio is off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXWARM</name>
                  <description>Radio is enabling receiver</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXSEARCH</name>
                  <description>Radio is listening for incoming frames</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXFRAME</name>
                  <description>Radio is receiving a frame</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPD</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2RX</name>
                  <description>Radio remains in receive mode after frame reception is completed</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXOVERFLOW</name>
                  <description>Received data was lost due to full receive buffer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RX2TX</name>
                  <description>Radio is disabling receiver and enabling transmitter</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXWARM</name>
                  <description>Radio is enabling transmitter</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX</name>
                  <description>Radio is transmitting data</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPD</name>
                  <description>Radio is powering down transmitter and going to OFF state</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2RX</name>
                  <description>Radio is disabling transmitter and enabling reception</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TX2TX</name>
                  <description>Radio is preparing for a transmission after the previous transmission was ended</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHUTDOWN</name>
                  <description>Radio is powering down receiver and going to OFF state</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IFPGACTRL</name>
          <description>No Description</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0FF80000</resetMask>
          <fields>
            <field>
              <name>DCCALON</name>
              <description>Enable/Disable DCCAL in DEMOD</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DC ESTI DISABLED</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DC ESTI ENABLED</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCRSTEN</name>
              <description>DC Compensation Filter Reset Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DC Comp out of Reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DC Comp in Reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCESTIEN</name>
              <description>DCESTIEN Override for RAC</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>DCESTI Disabled in MODEM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DCESTI Enabled in MODEM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCALDEC0</name>
              <description>DEC0 Value for DCCAL</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DF3</name>
                  <description>Decimation Factor 0 = 3. Cutoff 0.050 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF4WIDE</name>
                  <description>Decimation Factor 0 = 4. Cutoff 0.069 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF4NARROW</name>
                  <description>Decimation Factor 0 = 4. Cutoff 0.037 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF8WIDE</name>
                  <description>Decimation Factor 0 = 8. Cutoff 0.012 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DF8NARROW</name>
                  <description>Decimation Factor 0 = 8. Cutoff 0.005 * f&lt;subscript&gt;HFXO&lt;/subscript&gt;.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCCALDCGEAR</name>
              <description>DC COMP GEAR Value for DCCAL</description>
              <bitOffset>25</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAENCTRL</name>
          <description>No Description</description>
          <addressOffset>0x0A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000100</resetMask>
          <fields>
            <field>
              <name>PARAMP</name>
              <description>PA output level ramping</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APC</name>
          <description>No Description</description>
          <addressOffset>0x0A8</addressOffset>
          <access>read-write</access>
          <resetValue>0xFF000000</resetValue>
          <resetMask>0xFF000004</resetMask>
          <fields>
            <field>
              <name>ENAPCSW</name>
              <description>software control bit for apc</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AMPCONTROLLIMITSW</name>
              <description>software amp_control top limit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
