NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21A010F512IM32.svd
        <register>
          <name>PATRIM2</name>
          <description></description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x30C0F87A</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <fields>
            <field>
              <name>PATRIMLDOFBHVPDRVLDO</name>
              <description>PATRIMLDOFBHVPDRVLDO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vreg_1p22</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_1p28</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_1p35</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_1p44</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMLDOFBHVPREREG</name>
              <description>PATRIMLDOFBHVPREREG</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vreg_1p678</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_1p735</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_1p801</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_1p875</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_3p00</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_3p14</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_3p3</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vreg_3p477</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMLDOHVPDRVLDO</name>
              <description>PATRIMLDOHVPDRVLDO</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref_0p675</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p700</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p725</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p750</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p775</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p800</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p825</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p850</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMLDOHVPREREG</name>
              <description>PATRIMLDOHVPREREG</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vref_0p651</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p663</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p676</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p688</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p701</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p713</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p726</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p738</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p751</name>
                  <description></description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p763</name>
                  <description></description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p776</name>
                  <description></description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p788</name>
                  <description></description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p801</name>
                  <description></description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p813</name>
                  <description></description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p826</name>
                  <description></description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vref_0p838</name>
                  <description></description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMLDOPSRPDRVLDO</name>
              <description>PATRIMLDOPSRPDRVLDO</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_psr</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high_psr</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMLDOPSRPREREG</name>
              <description>PATRIMLDOPSRPREREG</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>low_psr</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>high_psr</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMLDOSLICESPDRVLDO</name>
              <description>PATRIMLDOSLICESPDRVLDO</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>iload_7p5mA</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>iload_15mA</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>iload_22p5mA</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>iload_30mA</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMLDOSLICESPREREG</name>
              <description>PATRIMLDOSLICESPREREG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>spare1</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spare2</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spare3</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>spare4</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMPADACGLITCH</name>
              <description>PATRIMPADACGLITCH</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>larger_glitch</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>smaller_glitch</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMNBIAS</name>
              <description>PATRIMNBIAS</description>
              <bitOffset>19</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vnbias_dn104mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_dn91mv</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_dn78mv</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_dn65mv</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_dn52mv</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_dn39mv</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_dn26mv</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_dn13mv</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_default</name>
                  <description></description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_up13mv</name>
                  <description></description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_up26mv</name>
                  <description></description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_up39mv</name>
                  <description></description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_up52mv</name>
                  <description></description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_up65mv</name>
                  <description></description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_up78mv</name>
                  <description></description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vnbias_up91mv</name>
                  <description></description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMNCASC</name>
              <description>PATRIMNCASC</description>
              <bitOffset>23</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ncbias_m50mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ncbias_default</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ncbias_p50mv</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ncbias_p100mv</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMPBIAS</name>
              <description>PATRIMPBIAS</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>vpbias_up104mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_up91mv</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_up78mv</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_up65mv</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_up52mv</name>
                  <description></description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_up39mv</name>
                  <description></description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_up26mv</name>
                  <description></description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_up13mv</name>
                  <description></description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_default</name>
                  <description></description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_dn13mv</name>
                  <description></description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_dn26mv</name>
                  <description></description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_dn38mv</name>
                  <description></description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_dn52mv</name>
                  <description></description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_dn65mv</name>
                  <description></description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_dn78mv</name>
                  <description></description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>vpbias_dn91mv</name>
                  <description></description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PATRIMPCASC</name>
              <description>PATRIMPCASC</description>
              <bitOffset>29</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>pcbias_p50mv</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcbias_default</name>
                  <description></description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcbias_m50mv</name>
                  <description></description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pcbias_m100mv</name>
                  <description></description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
